models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `user` WHERE `id`=1

    public static function findIdentityByAccessToken($token, $type = null)
    {
        // API авторизация: отправить в header:
        // Authorization : Basic base64(token:)
        // для каждого API запроса
        return static::findOne(['token' => $token]);
---
SELECT * FROM `user` WHERE `token`='admin'